app/controllers/releases_controller.rb

  def index

    params[:page] ||= 1

    @releases = Release.search(params[:search], params[:page])
---
SELECT "releases".* FROM "releases" WHERE (archived = 'f') LIMIT 30 OFFSET 0